Autodesk.Revit.DB.Structure.StructuralMaterialType
Since:
2011
Represents the structural material type.  This enum value is returned by Autodesk::Revit::DB::FamilyInstance::StructuralMaterialType.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralMaterialType.Aluminum
Structural material type is aluminum.

Autodesk.Revit.DB.Structure.StructuralMaterialType.Generic
Structural material type is generic.

Autodesk.Revit.DB.Structure.StructuralMaterialType.PrecastConcrete
Structural material type is precast concrete.

Autodesk.Revit.DB.Structure.StructuralMaterialType.Other
Structural material type is other.

Autodesk.Revit.DB.Structure.StructuralMaterialType.Wood
Structural material type is wood.

Autodesk.Revit.DB.Structure.StructuralMaterialType.Concrete
Structural material type is concrete.

Autodesk.Revit.DB.Structure.StructuralMaterialType.Steel
Structural material type is steel.

Autodesk.Revit.DB.Structure.StructuralMaterialType.Undefined
Structural material type is undefined.